// frontend/src/data/mawangData.js

/**
 * 총 24개 마왕(캐릭터) 정보
 *
 * id: 순번 (숫자)  
 * name: 캐릭터 이름 (문자열)  
 * imageUrl: public/mawang/ 폴더 내 이미지 파일 경로 ("/mawang/mawangX.png")  
 * description: 간단 설명 (문자열)
 */
const mawangData = [
  {
    id: 1,
    name: "애정",
    imageUrl: "/mawang/aejeong.png",
    description: "2024년 9월 11일부터 생방송 중 만든 아바타로, 구상 이미지는 히키코모리, 봇치, 커뮤증. 유정이가 개백수인데도 너무 뽀송뽀송해 확실히 꼬질꼬질한 이미지로 만들었다. 색감과 머리 스타일 때문에 모구구와 비슷하다는 이야기를 많이 들었으나 둘이 놓고 비교하면 그렇게 닮진 않았다. 이상할 정도로 동료 여자 버튜버들에게 인기가 많다."
  },
  {
    id: 2,
    name: "아즈키",
    imageUrl: "/mawang/azuki.png",
    description: "귀여운 아이 캐릭터지만 의외로 몸개그를 보인다. 처음 등장시 이름이 마왕냥이였다. 등장 이후 족제비 콘셉트로 변했다가 고양이 콘셉트로 돌아왔다."
  },
  {
    id: 3,
    name: "아기쿠마",
    imageUrl: "/mawang/baby_kuma.png",
    description: "아기상어와 쌍둥이 캐릭터. 히나보다 키가 좀더 크다. 등장은 거의 없는 편이다."
  },
  {
    id: 4,
    name: "아기상어",
    imageUrl: "/mawang/baby_shark.png",
    description: "아기쿠마와 쌍둥이 캐릭터. 히나보다 키가 좀더 크다. 등장은 거의 없는 편이다."
  },
  {
    id: 5,
    name: "아기유정",
    imageUrl: "/mawang/baby_yujeong.png",
    description: "유정이의 아기 버전."
  },
  {
    id: 6,
    name: "치비(아기코코)",
    imageUrl: "/mawang/chibi.png",
    description: "마왕의 첫 영상부터 다섯 번째 영상까지 극초창기에 등장한 캐릭터이다. 전체적인 느낌은 아기상어, 아기쿠마 캐릭터와 비슷하다. 설정상 코코의 어린 시절이다."
  },
  {
    id: 7,
    name: "코코",
    imageUrl: "/mawang/coco.png",
    description: "레나처럼 뿔을 가진 캐릭터. 직업은 선생님 혹은 프로그래머로 추정. 눈물이 많은 것으로 보인다. 어린 시절인 치비와 만나며 지친 일상을 되시작하는 모습을 보여준다."
  },
  {
    id: 8,
    name: "코코아",
    imageUrl: "/mawang/cocoa.png",
    description: "섹시한 콘셉트의 캐릭터. 캐릭터의 모티브는 친구가 그려준 자신이라고 한다. 다른 캐릭터와 달리 몸에 오일을 바른 듯한 반짝임이 적용되어 있고, 몸에 문신이 많다. 노출이 높은 의상 비중이 은근 많으며 매운 맛 영상은 대부분 코코아가 찍는다. 귀여운 외모와 섹시한 콘셉트 덕에 인기가 많다."
  },
  {
    id: 9,
    name: "다정",
    imageUrl: "/mawang/dajeong.png",
    description: "원래 마왕의 다른 아바타들에 비해 밝은 양지 느낌의 아바타. 이쁘다고 좋아하는 사람도 많지만 초기엔 어색하다고 느낀 사람도 많았다. 동료 버튜버들도 '마왕은 퇴폐미인데 그게 없다'며 어색함을 표현하기도 했다. 특징은 다른 아바타보다도 웃상이라 원래도 웃음이 많은 마왕의 웃상이 더 도드라지는 점. 다른 아바타들에 비해 상대적으로 노출이 적은 편."
  },
  {
    id: 10,
    name: "악마",
    imageUrl: "/mawang/devil.png",
    description: "기존 캐릭터들과 다르게 파란색 느낌이 없고 분홍색 느낌이 강하다. 악마답게 기존 캐릭터들에게 어떤 음모를 꾸미는 듯한 모습으로 등장했지만 바로 다음 친하게 지내는 모습으로 나왔다. 그러나 악마 콘셉트를 충실히 지키며 반전된 모습으로 등장했다."
  },
  {
    id: 11,
    name: "하카",
    imageUrl: "/mawang/hakka.png",
    description: "고양이 귀를 한 메인 캐릭터. 귀여운 모습이나 허당끼 있는 모습이나 오타쿠스러운 모습을 보여준다. 레나랑 같이 나오는 경우가 많다. 유튜브 영상 끝마다 아웃트로에 발레하면서 클로징을 한다."
  },
  {
    id: 12,
    name: "히나",
    imageUrl: "/mawang/hina.png",
    description: "햄스터 옷을 입은 꼬마. 사실 원래는 햄스터 탈을 쓰지 않고 아기 마왕영상으로 나왔으나 '뭐하고 있니 마왕 햄스터' 영상 이후로는 계속 햄스터로 나온다. 매우 귀엽기 때문인지 상당한 인기를 자랑한다. 매우 속도가 빠르며 괴력의 소유자이다. 가장 작은 키를 가지고 있다. 하지만 어른 햄스터가 되면 어른 아기상어, 어른 아기쿠마보다도 커진다. (TMI : 이세계아이돌 멤버들의 햄스터 아바타 시리즈는 히나 에셋을 응용하여 만들었다.)"
  },
  {
    id: 13,
    name: "미정",
    imageUrl: "/mawang/mijeong.png",
    description: "2022년 04월 14일에 트위치 라이브 방송에서 제작한 캐릭터이다. 갸루 콘셉트로 제작되었다. 크게 흑발과 금발 두 머리색을 사용하며, 같은 얼굴이지만 다른 분위기를 풍긴다. 제작 후 5일이 지나도 이름이 정해지지 않아, 아직 정해지지 않았다는 뜻의 '미정(未定)'이라고 하다가 '미정'을 이름으로 쓰자는 의견이 나왔는데, 마왕은 다른 아바타들의 이름과 전혀 어울리지 않는 이름이라고 다른 이름을 원하였다. 하지만 방송을 진행함에 따라 결국 자연스럽게 미정이라고 부르게 되어 사실상 명칭으로 굳히게 되었고, 이후 예정이와 선정이의 이름을 지을 때도 영향을 줬다. 캐릭터가 인기가 많아 미정이 캐릭터를 만든 후 팬카페 회원수가 급격히 늘어났다. 2022년 7월 5일에 메인채널에 미정이 소개영상이 올라왔다."
  },
  {
    id: 14,
    name: "마이크",
    imageUrl: "/mawang/mike.png",
    description: "근육남 아저씨. 드물게 갭모에로 눈갱을 선사하지만 대체로 널어놓은 이불을 터는 캐릭터로 등장한다. 당연히 키가 제일 크다."
  },
  {
    id: 15,
    name: "냐스카",
    imageUrl: "/mawang/nyaska.png",
    description: "볼에 반창고를 붙이고 있으며 키는 중간이고 전체적으로 노란색이 많이 들어가 있다. 요즘 영상에는 잘 나오지 않는다."
  },
  {
    id: 16,
    name: "리얼마왕",
    imageUrl: "/mawang/real_mawang.png",
    description: "번 아웃 영상에서 등장한 캐릭터로 편집자 마왕을 표현한 캐릭터이다. 한국 팬 사이에서는 영상과 더불어 꽤 인기가 많다. 그러나 다른 캐릭터들과는 다른 세계관에 존재하는 캐릭터라 밈영상에서는 사용할 생각이 없다고 한다. 라이브 스트리밍에서 몇번 사용했지만 거의 볼 수 없다. 어두운 콘셉트에 맞게 흡연자이다."
  },
  {
    id: 17,
    name: "레나",
    imageUrl: "/mawang/rena.png",
    description: "악마를 연상시키는 뿔을 한 캐릭터. 여캐인 것이 거의 확실하나 영상 여러 장면에서 남성 보이스로 나오곤 한다. 영 좋지 않은 곳을 가격 당하거나 온갖 몸개그로 굴러다니는 등 망가지는 역할이 많다. 마왕의 최애 캐릭터이기도 하다."
  },
  {
    id: 18,
    name: "선정",
    imageUrl: "/mawang/seonjeong.png",
    description: "2022년 8월 6일에 만들어진 캐릭터이다. 초기 콘셉트는 수위가 있는 심연 캐릭터를 만들려고 했지만 완성되니 청순하고 귀여운 캐릭터가 되었다. 콘셉트가 선정적이라 이름을 선정이라고 지었다. 콘셉트에 맞게 입는 의상들이 대부분 노출이 있다. 캐릭터를 만들 때 떠오르는 아이디어가 없어서 고생을 하였다."
  },
  {
    id: 19,
    name: "소정",
    imageUrl: "/mawang/sojeong.png",
    description: "2023년 9월 10일부터 생방송 중 만든 아바타로, 구상 단계에서 잼민이와 지뢰계 이미지를 떠올렸으나, 최종적으로 완성된 아바타는 지뢰계 이미지는 좀 약해졌다."
  },
  {
    id: 20,
    name: "흑수정",
    imageUrl: "/mawang/sujeong_black.png",
    description: "수정이의 블랙 버전."
  },
  {
    id: 21,
    name: "백수정",
    imageUrl: "/mawang/sujeong_white.png",
    description: "2022년 12월 10일 공개된 캐릭터이다. 코로나에 걸려 아픈 동안 할 게 없어 만들었다고 한다. 아바타 완성도에 꽤 만족했는지 공개 당시 '선정'이 이제 어떻게 하냐면서 비교하기도 했다. VRChat 내에서 꽤나 메인으로 쓰는 캐릭터다."
  },
  {
    id: 22,
    name: "울페리아",
    imageUrl: "/mawang/wolferia.png",
    description: "키가 크고 눈나 같은 느낌의 캐릭터이다. 이빨이 뾰족하다. 트위치 방송 중에 팬카페에 올라온 울페리아 팬아트를 보고 누군지 못알아보다가 '아 이런 캐릭터도 있었구나'라고 한적이 있다."
  },
  {
    id: 23,
    name: "예정",
    imageUrl: "/mawang/yejeong.png",
    description: "2022년 7월 4일에 만들어진 캐릭터이다. 현생에 치여서 피폐해진 직장인을 콘셉트로 만들어졌다. 시크한 콘셉트와 외모를 가지고 있으며 사원증을 자세히보면 신입 사원시절 다크서클이 없는 예정이의 사진을 볼 수 있다."
  },
  {
    id: 24,
    name: "유정",
    imageUrl: "/mawang/yujeong.png",
    description: "2023년 4월 13일부터 만들어서 15일쯤 이름을 유정으로 확정됐다. 보통 마왕의 시그니처인 개백수티를 입고 있으며 2.0 보이스 사용과 맞물려 가장 많이 사용하는 캐릭터가 되었으며, 현 시점에서는 저챗이나 게임 방송에서는 주로 메인으로 사용하고 있다. (TMI : 웹페이지 개발자의 최애다.)"
  }
];

export default mawangData;
